Show / Hide Table of Contents
Namespace IdeaRS.OpenModel.Concrete
Classes
BeamDataEc2
Beam data Ec2
CalculationSetup
Concrete calculation setup
ColumnData
Column data base
ColumnDataEc2
Column data Ec2
ConcreteMemberData
Concrete member data base
ConcreteMemberDataEc2
Concrete member data Ec2
ConcreteSetup
Concrete setup base class
ConcreteSetupEc2
Concrete setup Ec2
ExposureClassesDataEc2
Exposure Classes Ec2
CheckSection
Check section base class
CheckSectionExtreme
Check section extreme base class
NadSetupValue
Setup value base
NadSetupValueBool
Setup value bool
NadSetupValueDouble
Setup value double
NadSetupValueFloat
Setup value float
NadSetupValueInt
Setup value int
NadSetupValueLong
Setup value long
NadSetupValueShort
Setup value bool
NadStrategyConcrete
Nad strategy concrete
ProjectDataConcrete
Project data concrete
ProjectDataConcreteEc2
Project data concrete Ec2
SetupValue
Setup value base
SetupValueBool
Setup value bool
SetupValueDouble
Setup value double
SetupValueFloat
Setup value float
SetupValueInt
Setup value int
SetupValueLong
Setup value long
SetupValueShort
Setup value bool
StagedCheckSection
Single check section
StagedCheckSectionExtreme
Standard check section extreme
StandardCheckSection
Single check section
StandardCheckSectionExtreme
Standard check section extreme
TimeAxis
Time axis
TimePoint
Point on time axis
Enums
ConcreteMemberType
Member type
DeflectionRequirementEc2
deflection calculation requirements
EffectConsideredType
Effect concidered types
ExposureClassEc2
Type of exposure class
ImperfectionDirection
direction of imperfection
InputValue
Input value type
MemberImportance
Member importance
NationalAnnexCode
Annex code
SecondOrderEffectMethodEc2
The type of method for calculation second order effect.
SetupValueEc2
Setup value types Ec2
SupportType
Types of support
TwoWaySlabType
Two way slab types
TypeDeflectionSheme
Scheme
TypeOfCalculationDeflection
Define type of support conditions
TypeOfSupportConditions
Define type of support conditions
ValueTypec
Define type of c value
ValueTypec0
Define type of c0 value